{
  "navlinks": [
    {
      "id": 1,
      "path": "/",
      "label": "Home"
    },
    {
      "id": 2,
      "path": "/about",
      "label": "About"
    },
    {
      "id": 3,
      "path": "/blog",
      "label": "Blog"
    },
    {
      "id": 4,
      "path": "/contact",
      "label": "Contact"
    }
  ],
  "about": [
    {
      "id": 1,
      "title": "Who We Are",
      "content": "We are rooted in Jesus Christ, nourished by the grace of the sacraments, and live as the body of Christ, spreading the message of the Gospel of Jesus Christ to those around us."
    },
    {
      "id": 2,
      "title": "Our Mission Vision and Values",
      "content": "Our vision is for every member to lead a life as a missionary disciple, striving to be formed in the image of Christ, and to live a life of mission with joy and enthusiasm."
    },
    {
      "id": 3,
      "title": "Archdiocese of Philadelphia",
      "content": "We are a part of the Archdiocese of Philadelphia. The Archdiocese of Philadelphia is a major ecclesiastical jurisdiction of the Catholic Church in Pennsylvania, serving the spiritual needs of Catholics in the region. Established in 1808, it has a rich history of promoting faith, education, and service to the community. The Archdiocese oversees numerous parishes, schools, and charitable organizations, providing guidance and support to help individuals grow in their faith and live out the teachings of Jesus Christ."
    },
    {
      "id": 4,
      "title": "Who Can be the Members of ILCC",
      "content": "We invite anyone who is baptized Catholic or would like to explore the Catholic faith. Though we are an ethnic Indian community, we warmly welcome all who wish to join us."
    }
  ],

  "verses": [
    {
      "id": 1,
      "reference": "Isaiah 40:31",
      "text": "But those who hope in the Lord will renew their strength. They will soar on wings like eagles; they will run and not grow weary, they will walk and not be faint."
    },
    {
      "id": 2,
      "reference": "Philippians 4:13",
      "text": "I can do all this through him who gives me strength."
    },
    {
      "id": 3,
      "reference": "Joshua 1:9",
      "text": "Have I not commanded you? Be strong and courageous. Do not be afraid; do not be discouraged, for the Lord your God will be with you wherever you go."
    },
    {
      "id": 4,
      "reference": "Psalm 46:1",
      "text": "God is our refuge and strength, an ever-present help in trouble."
    },
    {
      "id": 5,
      "reference": "Romans 8:28",
      "text": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose."
    },
    {
      "id": 6,
      "reference": "Psalm 23:4",
      "text": "Even though I walk through the darkest valley, I will fear no evil, for you are with me; your rod and your staff, they comfort me."
    },
    {
      "id": 7,
      "reference": "Isaiah 41:10",
      "text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand."
    },
    {
      "id": 8,
      "reference": "Proverbs 3:5-6",
      "text": "Trust in the Lord with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight."
    },
    {
      "id": 9,
      "reference": "Psalm 27:1",
      "text": "The Lord is my light and my salvation—whom shall I fear? The Lord is the stronghold of my life—of whom shall I be afraid?"
    }
  ]
}
